Repository: sonnyp/commit
Catalog: po/*.po
Languages: de, ro, sk, ta, uk

source: Commit
ta: கமிட்

source: Commit message editor
de: Commit Nachrichteneditor
ro: Editor de mesaje de comitere de modificări (commit)
sk: Editor správ commitov
ta: செய்தி எடிட்டரைச் செய்யுங்கள்
uk: Редактор коммітів Git

source: git;mercurial;hg;scm;gnomit;komet;comet;
ta: git; மெர்குரியல்; Hg; scm; gnomit; கோமட்; வால்மீன்;

source: Title maximum length (in characters)
de: Maximale Titellänge (in Zeichen)
ro: Lungimea maximă a titlului (în caractere)
sk: Maximálna dĺžka titulku (v znakoch)
ta: தலைப்பு அதிகபட்ச நீளம் (எழுத்துக்களில்)
uk: Максимальна довжина заголовка (у символах)

source: Body lines maximum length (in characters)
de: Maximale Textlänge (in Zeichen)
ro: Lungimea maximă a liniilor corpului (în caractere)
sk: Body linky maximálna dĺžka (v charakteroch)
ta: உடல் கோடுகள் அதிகபட்ச நீளம் (எழுத்துகளில்)
uk: Максимальна довжина вмісту (у символах)

source: Commit is an editor that helps you write better Git and Mercurial commit messages.
de: Commit ist ein Editor, um bessere Commit-Nachrichten für Git und Mercurial zu schreiben.
ro: Commit este un editor care vă ajută să scrieți mesaje de comitere de modificări, Git și Mercurial, mai bune.
sk: Commit je editor, ktorý vám pomôže lepšie napísať správy commitov v systéme Git a Mercurial.
ta: கமிட் என்பது ஒரு எடிட்டர், இது சிறந்த அறிவிலி மற்றும் மெர்குரியல் கமிட் செய்திகளை எழுத உதவுகிறது.
uk: Commit - це редактор, який допомогає Вам писати кращі комміти Git та Mercurial.

source: After installing make sure to launch the application and follow the instructions.
de: Starte nach der Installation die Anwendung und folge den Anweisungen.
ro: După instalare, asigurați-vă că lansați aplicația și urmați instrucțiunile.
sk: Po inštalácii nezabudnite aplikáciu spustiť a postupovať podľa pokynov.
ta: நிறுவிய பின் பயன்பாட்டைத் தொடங்குவதை உறுதிசெய்து வழிமுறைகளைப் பின்பற்றவும்.
uk: Після встановлення запустіть застосунок та дотримуйтесь інструкцій.

source: Commit will pop up automatically when you make a commit in one of your projects. To save your commit message, press the Commit button or the <code>Ctrl+Return</code> shortcut. To abort and dismiss Commit, press the Abort button or the <code>Escape</code> key.
de: Commit öffnet sich automatisch, wenn du einen Commit in einem deiner Projekte machst. Um eine Commit-Nachricht zu speichern, drücke den Commit-Button oder die Tastenkombination <code>Ctrl+Return</code>. Zum Abbrechen oder Beenden von Commit, drücke Abbrechen oder die <code>Escape</code> Taste.
ro: Commit va apărea automat când faceți o modificare într-unul dintre proiectele dvs. Pentru a salva mesajul de comitere a modificării, apăsați butonul «Comitere modificări» sau comanda rapidă <code>Ctrl+Return</code>. Pentru a anula și a revoca Comiterea modificărilor, apăsați butonul «Anulare» sau tasta <code>Escape</code>.
sk: Chemosvit sa automaticky vypne, keď urobíte spáchanie v jednom z vašich projektov. Ak chcete uložiť svoju doručovaciu správu, stlačte tlačidlo Commit alebo <code>Ctrl+Return</code> skratka. Ak chcete abort a prepustiť Commit, stlačte tlačidlo Abort alebo <code>Escape</code> kľúč.
ta: உங்கள் திட்டங்களில் ஒன்றில் நீங்கள் ஈடுபடும்போது கமிட் தானாகவே பாப் அப் செய்யும். உங்கள் கமிட் செய்தியைச் சேமிக்க, கமிட் பொத்தான் அல்லது <code> ctrl+திரும்ப </code> குறுக்குவழியை அழுத்தவும். கருக்கலைப்பு செய்ய மற்றும் நிராகரிக்க, கருக்கலைப்பு பொத்தானை அழுத்தவும் அல்லது <code> தப்பிக்க </code> விசையை அழுத்தவும்.
uk: Комміт з'явиться автоматично, коли ви зробите комміт у одному з своїх проектів. Щоб зберегти своє повідомлення, натисніть кнопку Commit або клавіатурне скорочення <code>Ctrl+Return</code>. Щоб переривати та відхилити комміт, натисніть кнопку "Abort" або клавішу <code>Escape </code>.

source: Features:
de: Besonderheiten:
ro: Caracteristici:
sk: Funkcie:
ta: அம்சங்கள்:
uk: Особливості:

source: Highlights overflow of the commit title
de: Hebt überhängende Zeichen des Commit-Titels hervor
ro: Evidențiază depășirea titlului mesajului de comitere a modificărilor
sk: Zvýrazňuje pretečenie nadpisu commitu
ta: கமிட் தலைப்பின் சிறப்பம்சங்கள்
uk: Виділення символів, що перевищують межі

source: Smart body wrapping
de: Automatischer Zeilenumbruch
ro: Încadrare inteligentă a corpului mesajului
sk: Inteligentné balenie tela
ta: அறிவுள்ள உடல் மடக்குதல்
uk: Розумне обгортання вмісту

source: Inserts a blank line between title and body
de: Fügt eine Leerzeile zwischen Titel und Text ein
ro: Inserează o linie goală între titlu și corp
sk: Vloží prázdny riadok medzi titulok a popis
ta: தலைப்பு மற்றும் உடலுக்கு இடையில் ஒரு வெற்று கோட்டை செருகும்
uk: Вставка порожнього рядка між заголовком та вмістом

source: Comments are readonly and excluded from "Select All"
de: Kommentare sind schreibgeschützt und von „Alle auswählen“ ausgeschlossen
ro: Comentariile sunt numai-pentru-citire și sunt excluse din „Selectați toate”
sk: Komentáre sú len na čitanie a sú vylúčené z "Vybrať všetko"
ta: கருத்துகள் படிக்கக்கூடியவை மற்றும் "அனைத்தையும் தேர்ந்தெடுக்கவும்" என்பதிலிருந்து விலக்கப்படுகின்றன
uk: Коментарі доступні лише для читання і вилучені з "Обрати усе"

source: Displays project folder and branch in window header
de: Zeigt Projektordner und Zweig im Fensterkopf an
ro: Afișează dosarul proiectului și ramura în antetul ferestrei
sk: Zobrazenie zložky projektu a vetvy v záhlaví okna
ta: திட்ட கோப்புறை மற்றும் கிளையை சாளர தலைப்பில் காட்டுகிறது
uk: Відображення гілки та текі проекта у заголовку вікна

source: Dark mode support
de: Beachtet Dunkel-Modus
ro: Suport pentru modul întunecat
sk: Podpora tmavého režimu
ta: இருண்ட பயன்முறை உதவி
uk: Підтримка темного режиму

source: Keyboard navigation and shortcuts
de: Tastatur-Navigation und -Kürzel
ro: Navigare și comenzi rapide de la tastatură
sk: Klávesové ovládanie a skratky
ta: விசைப்பலகை வழிசெலுத்தல் மற்றும் குறுக்குவழிகள்
uk: Навігація клавіатурою та клавіатурні скорочення

source: Undo/Redo support
de: Rückgängig/Wiederholen
ro: Suport pentru anulare/refacere
sk: Podpora späť a znovu
ta: ஆதரவை செயல்தவிர்க்கவும்/மீண்டும் செய்யவும்
uk: Підтримка Скасувати/Повторити (Undo/Redo)

source: Emoji picker
de: Emoji-Auswahl
ro: Selector de pictograme „emoji”
sk: Výber emotikonov
ta: ஈமோசி பிக்கர்
uk: Вибрати емодзі

source: Supports git commit, merge, tag --annotate, add --patch, rebase --interactive
de: Unterstützt folgende git-Befehle: commit, merge, tag --annotate, add --patch, rebase -interactive
ro: Funcționează cu git commit, merge, tag --annotate, add --patch, rebase --interactive
sk: Podporuje git spáchanie, zlúčiť, tag --annotate, pridať --patch, rebase --interactive
ta: Git commact, forge, tag --annotate, கூட்டு - -patch, redase -interactive
uk: Підтримка git commit, merge, tag --annotate, add --patch, rebase --interactive

source: Supports Mercurial commit
de: Unterstützt Mercurial commit
ro: Acceptă comanda commit de la Mercurial
sk: Podporuje správy commitov Mercurial
ta: மெர்குரியல் கமிட்டத்தை ஆதரிக்கிறது
uk: Підтримка коммітів Mercurial

source: Auto capitalize the commit title
de: Titel automatisch großschreiben
ro: Pune automat în majusculă începutul titlului mesajului de comitere a modificărilor
sk: Auto kapitalizovať titul
ta: ஆட்டோ கமிட் தலைப்பை மூலதனமாக்கவும்
uk: Автоматична капіталізація заголовка комміту

source: Welcome window with settings and instructions
de: Willkommens-Fenster mit Einstellungen und Anleitung
ro: Fereastră de bun venit cu configurarea și instrucțiunile de uz ale programului
sk: Uvítacie okno s nastaveniami a pokynmi
ta: அமைப்புகள் மற்றும் வழிமுறைகளுடன் சாளரத்தை வரவேற்கிறோம்
uk: Вікно вітання з налаштуваннями та інструкціями

source: Highlight syntax for Git, Mercurial and diffs
de: Syntax hervorheben für Git, Mercurial und diffs
ro: Evidențiere sintaxă pentru Git, Mercurial și diffs
sk: Zvýrazňuje syntaxiu Gitu, Mercurialu, aj rozdiely
ta: அறிவிலி, மெர்குரியல் மற்றும் வேறுபாடுகளுக்கான தொடரியல் முன்னிலைப்படுத்தவும்
uk: Виділення синтаксису для Gir, Mercurial та diff

source: Main window
de: Hauptfenster
ro: Fereastra principală
sk: Hlavné okno
ta: முதன்மை சாளரம்
uk: Головне вікно

source: Emoji selector
de: Emoji-Wähler
ro: Selector de pictograme „emoji”
sk: Emoji výberor
ta: ஈமோசி தேர்வாளர்
uk: Вибір емодзі

source: Shortcuts
de: Tastaturkürzel
ro: Combinații taste rapide
sk: Skratky
ta: குறுக்குவழிகள்
uk: Скорочення

source: Welcome window
de: Willkommens-Fenster
ro: Fereastră de bun venit
sk: Uvítacie okno
ta: வரவேற்பு சாளரம்
uk: Вікно вітання

source: Resize the window to disable auto formatting
de: Verändere die Größe des Fensters, um die Autoformatierung zu deaktivieren
ro: Redimensionați fereastra pentru a dezactiva formatarea automată
sk: Označiť okno vypnúť automatické formátovanie
ta: ஆட்டோ வடிவமைப்பை முடக்க சாளரத்தை அளவை மாற்றவும்
uk: Змініть розмір вікна щоб вимкнути автоматичне форматування

source: Add a theme switcher
de: Stil-Wechsler hinzufügen
ro: Adăugați un comutator de teme
sk: Pridajte prepínač témy
ta: கருப்பொருள் ச்விட்சரைச் சேர்க்கவும்
uk: Додано перемикач тем

source: Improve dark mode support
de: Unterstützung für Dunkel-Modus verbessern
ro: Îmbunătățirea suportului pentru modul întunecat
sk: Vylepšiť podporu tmavého režimu
ta: இருண்ட பயன்முறை ஆதரவை மேம்படுத்தவும்
uk: Покращено підтримку темного режиму

source: Support numpad enter
de: Enter-Taste des Nummernblocks unterstützen
ro: Acceptă intrarea de la tastatura numerică
sk: Podpora numpad vstúpiť
ta: எண்பலகை ENTER ஐ ஆதரிக்கவும்
uk: Додано підтримку Enter на numpad

source: Add mnemonics for buttons
de: Mnemonics für Buttons hinzufügen
ro: Adaugă elemente mnemonice pentru butoane
sk: Pridať mimomonics pre tlačidlá
ta: பொத்தான்களுக்கு நினைவூட்டல் சேர்க்கவும்
uk: Додано мнемоніку для кнопок

source: Fix capitalization when amending
de: Großschreiben während "amend" reparieren
ro: Corectarea majusculelor la modificare
sk: Opraviť kapitalizáciu pri úprave
ta: திருத்தும்போது மூலதனத்தை சரிசெய்யவும்
uk: Виправлено капіталізацію під час поправок

source: Improve auto capitalization
de: Automatische Großschreibung verbessern
ro: Îmbunătățirea scrierii automate cu majuscule
sk: Zlepšite automatickú kapitalizáciu
ta: வாகன மூலதனத்தை மேம்படுத்தவும்
uk: Покращено автоматичну капіталізацію

source: Add support for gitconfig and hgrc
de: Unterstützung für gitconfig und hgrc hinzufügen
ro: Adaugă suport pentru gitconfig și hgrc
sk: Pridať podporu pre gitconfig a hgrc
ta: GitConfig மற்றும் HGRC க்கு ஆதரவைச் சேர்க்கவும்
uk: Додано підтримку gitconfig та hgrc

source: Support editing any file
de: Jedes Dateiformat bearbeiten
ro: Oferă suport pentru editarea oricărui fișier
sk: Podpora úpravy akéhokoľvek súboru
ta: எந்த கோப்பையும் திருத்துவதற்கு ஆதரவளிக்கவும்
uk: Додано підтримку редагування будь-якого файлу

source: Make the primary button label dynamic (Tag, Rebase, Commit, ...)
de: Der Hauptbutton ist nun dynamisch (Commit, Tag, Rebase, ...)
ro: Fă ca eticheta butonului principal să fie dinamică («Etichetă», «Rebase», «Comitere modificări», ...)
sk: Urobte primárne tlačidlo štítok dynamické (Tag, Rebase, Commit, ...)
ta: முதன்மை பொத்தான் சிட்டை மாறும் (குறிச்சொல், மறுதொடக்கம், கமிட், ...)
uk: Зроблено динамічний текст на головній кнопці (Tag, Rebase, Commit, тощо)

source: Use 2 spaces indentation
de: 2 Leerzeichen als Einrückung verwenden
ro: Utilizează 2 spații pentru indentare
sk: Používanie 2 medzery
ta: 2 இடங்கள் உள்தள்ளலைப் பயன்படுத்தவும்
uk: Додано використання відступу з двома пробілами

source: Add menu button
de: Schaltfläche Menü hinzufügen
ro: Adaugă butonul de meniu
sk: Pridať tlačítko menu
ta: பட்டியல் பொத்தானைச் சேர்க்கவும்
uk: Додано кнопку меню

source: GNOME Platform 42
de: GNOME-Plattform 42
ro: Platforma GNOME 42
sk: GNOME Platforma 42
ta: க்னோம் இயங்குதளம் 42
uk: Платформа GNOME 42

source: Various fixes
de: Verschiedene Korrekturen
ro: Diverse corectări
sk: Rôzne opravy
ta: பல்வேறு திருத்தங்கள்
uk: Різні виправлення

source: Add keyboard shortcuts for moving lines up and down
de: Tastaturkurzbefehle zum Verschieben von Zeilen nach oben und unten hinzufügen
ro: Adăugați comenzi rapide de la tastatură pentru deplasarea liniilor în sus și în jos
sk: Pridať klávesové skratky pre pohybové linky hore a dole
ta: வரிகளை மேலே மற்றும் கீழ் நகர்த்த விசைப்பலகை குறுக்குவழிகளைச் சேர்க்கவும்
uk: Додано клавіатурні скороченя щоб переміщати рядки вгору та вниз

source: Highlight syntax for Git, Mercurial, and diffs
de: Syntax für Git, Mercurial und Diffs hervorheben
ro: Evidențiază sintaxa pentru Git, Mercurial și diffs
sk: Zvýrazniť syntaxiu pre Git, Mercurial, aj rozdiely
ta: அறிவிலி, மெர்குரியல் மற்றும் வேறுபாடுகளுக்கான தொடரியல் முன்னிலைப்படுத்தவும்
uk: Додано виділення синтаксису для Git, Mercurial and diffs

source: Add a shortcuts window
de: Fenster für Kurzbefehle hinzufügen
ro: Adăugați o fereastră cu comenzi rapide
sk: Pridať okno predvolieb
ta: குறுக்குவழிகள் சாளரத்தைச் சேர்க்கவும்
uk: Додано вікно скорочень

source: Remove spell check temporarily
de: Rechtschreibprüfung vorübergehend entfernen
ro: Elimină temporar verificarea ortografică
sk: Dočasne odstráňte kontrolu pravopisu
ta: எழுத்துப்பிழை சோதனை தற்காலிகமாக அகற்றவும்
uk: Тимчасово прибрано перевірку правописання

source: Support undo and redo
de: Rückgängig machen und Wiederherstellen unterstützen
ro: Suport pentru anulare și refacere
sk: Podporuje späť a znovu
ta: செயல்தவிர்க்கவும் மீண்டும் செய்யவும்
uk: Додано підтримку скасування та повторення (undo/redo)

source: Add symbolic icon
de: Symbolisches Zeichen hinzufügen
ro: Adaugă o pictogramă simbolică
sk: Pridané symbolické ikony
ta: குறியீட்டு ஐகானைச் சேர்க்கவும்
uk: Додано сиволичну іконку

source: Add dark mode setting
de: Einstellung für den dunklen Modus hinzufügen
ro: Adaugă opțiunea de alegere a modului întunecat
sk: Pridané nastavenie tmavého režimu
ta: இருண்ட பயன்முறை அமைப்பைச் சேர்க்கவும்
uk: Додане налаштування "темний режим"

source: Focus the text editor
de: Texteditor fokussieren
ro: Focalizează editorul de text
sk: Zameranie na textový editor
ta: உரை எடிட்டரை மையப்படுத்தவும்
uk: Зфокусовано редактор

source: Port to GTK 4 and libadwaita
de: Auf GTK 4 und libadwaita portieren
ro: Adaptarea la GTK 4 și libadwaita
sk: Port na GTK 4 a libadwaita
ta: சி.டி.கே 4 மற்றும் லிபாட்வைட்டா வரை துறைமுகம்
uk: Портовано на GTK4 і libadwaita

source: Move preferences to welcome window
de: Einstellungen in das Willkommensfenster verschieben
ro: Mutarea preferințelor în fereastra de întâmpinare
sk: Presunúť predvoľby do uvítacieho okna
ta: சாளரத்தை வரவேற்க விருப்பங்களை நகர்த்தவும்
uk: Переміщено параметри у вікно вітання

source: Only highlight text overflow on commits
de: Textüberlauf nur bei Commits hervorheben
ro: Evidențiază doar depășirea textului din mesajulde comitere a modificărilor
sk: Zvýraznenie iba pretečenia textu pri commitoch
ta: கமிட்சில் உரை வழிதல் மட்டுமே முன்னிலைப்படுத்தவும்
uk: Додано виділення тільки тексту, який перевищує межі

source: New app icon
de: Neues App-Symbol
ro: Pictogramă nouă pentru aplicație
sk: Nová ikona aplikácie
ta: புதிய பயன்பாட்டு படவுரு
uk: Додано нову іконку застосунку

source: Remove double border
de: Doppelten Rand entfernen
ro: Elimină marginea dublă
sk: Odstránené dvojité orámovanie
ta: இரட்டை எல்லையை அகற்று
uk: Прибрано подвійні межі

source: Add a Preferences window
de: Einstellungsfenster hinzufügen
ro: Adăugarea unei ferestre Preferențe
sk: Pridáné okno Predvoľby
ta: விருப்பத்தேர்வுகள் சாளரத்தைச் சேர்க்கவும்
uk: Додано вікно налаштувань

source: Set default title length hint to 50 characters
de: Standardhinweis für die Titellänge auf 50 Zeichen festlegen
ro: Stabilește lungimea implicită a titlului la 50 de caractere
sk: Nastavenie predvolenej dĺžky titulku na 50 znakov
ta: இயல்புநிலை தலைப்பு நீள குறிப்பை 50 எழுத்துகளுக்கு அமைக்கவும்
uk: Значення за замовчуванням для заголовка встановлено рівним 50

source: Fix reading commits with special characters
de: Fehler beim Lesen von Commits mit Sonderzeichen beheben
ro: Corectarea citirii mesajelor de comitere a modificărilor cu caractere speciale
sk: Opravené čítanie commitov so špeciálnymi znakmi
ta: சிறப்பு எழுத்துக்களுடன் வாசிப்பு கமிட்டுகளை சரிசெய்யவும்
uk: Виправлено читання коммітів зі спеціальними символами

source: Fix git rebase not recognized
de: Fehler von nicht erkanntem Git-Neubasieren beheben
ro: Corectare git rebase nerecunoscut
sk: Opravené nerozpoznanie git rebase
ta: Git மறுதொடக்கம் அங்கீகரிக்கப்படவில்லை
uk: Виправлено "git rebase не визнано"

source: Make windows bottom corners rounded
de: Untere Fensterecken abgerundet
ro: Rotunjește colțurile de jos ale ferestrelor
sk: Zaoblenie spodných okrajov okien
ta: சாளரங்கள் கீழ் மூலைகளை வட்டமாக ஆக்குங்கள்
uk: Зроблено нижні кути вікна закругленими

source: Add 6px margin to editor
de: Dem Editor 6 px Rand hinzugefügt
ro: Adaugă o margine de 6px la editor
sk: Pridaný 6px okraj do editoru
ta: எடிட்டரில் 6px விளிம்பைச் சேர்க்கவும்
uk: Додано відступ у 6 пікселів у редакторі

source: Action required. After updating, please launch the application and follow the instructions.
de: Aktion erforderlich. Bitte starten Sie nach der Aktualisierung die Anwendung und folgen Sie den Anweisungen.
ro: Acțiune necesară. După actualizare, vă rugăm să lansați aplicația și să urmați instrucțiunile.
sk: ⚠️ Vyžadovaná akcia. Po aktualizácii prosím spustite aplikáciu a postupujte podľa pokynov.
ta: நடவடிக்கை தேவை. புதுப்பித்த பிறகு, விண்ணப்பத்தைத் தொடங்கி வழிமுறைகளைப் பின்பற்றவும்.
uk: Потрібна дія. Після оновлення, будь ласка, запустіть застосунок та дотримуйтесь інструкцій.

source: Show a welcome window when launched from desktop
de: Zeigt beim Start vom Desktop ein Willkommensfenster an
ro: Afișează o fereastră de întâmpinare la lansarea din meniul de aplicații al biroului
sk: Zobrazenie uvítacieho okna pri spustení z plochy
ta: டெச்க்டாப்பில் இருந்து தொடங்கும்போது வரவேற்பு சாளரத்தைக் காட்டு
uk: Додано показування вікна вітання коли запущено зі стільниці

source: Add support for Mercurial
de: Unterstützung für Mercurial hinzugefügt
ro: Adaugă suport pentru Mercurial
sk: Pridaná podpora pre Mercurial
ta: மெர்குரியலுக்கு ஆதரவைச் சேர்க்கவும்
uk: Додано підтримку Mercurial

source: Remove filesystem permission
de: Dateisystemberechtigung entfernt
ro: Elimină permisiunea sistemului de fișiere
sk: Odstránené oprávnenie súborového systému
ta: கோப்பு முறைமை அனுமதியை அகற்று
uk: Прибрано дозвіл до файлової системи

source: Initial release. Forked from Gnomit 2.0.
de: Erstveröffentlichung. Fork von Gnomit 2.0.
ro: Versiune inițială. Desprinsă din Gnomit 2.0.
sk: Prvé vydanie. Prevzaté z Gnomit 2.0.
ta: தொடக்க வெளியீடு. க்னோமிட் 2.0 இலிருந்து முட்கரண்டி.
uk: Початковий випуск. Форкнуто з Gnomit 2.0.

source: Support "#" in commit message
de: Unterstützung für „#“ in der Commit-Nachricht
ro: Suport pentru „#” în mesajul de comitere al modificărilor
sk: Podpora "#" v správach commitov
ta: கமிட் செய்தியில் "#" ஐ ஆதரிக்கவும்
uk: Додано підтримку "#" у комміті

source: Properly recognize executable path
de: Korrektes Erkennen des Pfades der ausführbaren Datei
ro: Recunoașterea corectă a rutei executabile
sk: Správne rozpoznanie cesty ku spustiteľnému súboru
ta: இயங்கக்கூடிய பாதையை சரியாக அங்கீகரிக்கவும்
uk: Виконаний шлях тепер розпізнається належним чином

source: translator-credits
ro: Remus-Gabriel Chelu <remusgabriel.chelu@disroot.org>
sk: MartinIIOT https://www.github.com/MartinIIOT
ta: மொழிபெயர்ப்பாளர்-வரவு
uk: Andrew Nitrogenesis (OSS Ukrainization Project) https://github.com/nitrogenez

source: _Merge
de: Zusa_mmenführen
ro: _Fuzionare
ta: _மர்ச்
uk: _Об'єднання

source: _Rebase
de: _Neubasieren
ta: _ ரிபேச்

source: _Save
de: _Speichern
ro: _Salvează
sk: _Uložiť
ta: _சேவ்
uk: _Зберегти

source: Editing
de: Bearbeitung
ro: Editare
sk: Upravovanie
ta: திருத்துதல்
uk: Редагування

source: Save and confirm
de: Speichern und bestätigen
ro: Salvează și confirmă
sk: Uložiť a potvrdiť
ta: சேமித்து உறுதிப்படுத்தவும்
uk: Зберегти та підтвердити

source: Cancel and dismiss
de: Abbrechen und verwerfen
ro: Anulare și revocare
sk: Zrušiť a zamietnuť
ta: ரத்து செய்து தள்ளுபடி
uk: Скасувати та відхилити

source: Open emoji chooser
de: Emoji-Auswahl öffnen
ro: Deschide selectorul de pictograme „emoji”
sk: Otvoriť výber emotikonov
ta: திறந்த ஈமோசி தேர்வு
uk: Відкрити вибір емоджи

source: Move current line up/down
de: Aktuelle Zeile nach oben/unten verschieben
ro: Mută linia curentă în sus/jos
sk: Presuňte aktuálny riadok hore/down
ta: தற்போதைய வரியை மேலே/கீழ் நகர்த்தவும்
uk: Перемістити цей рядок вгору/вниз

source: Select All
de: Alles auswählen
ro: Selectează tot
sk: Vybrať všetko
ta: அனைத்தையும் தெரிவுசெய்
uk: Обрати усе

source: Unelect All
de: Alles abwählen
ro: Deselectează tot
sk: Vyberte všetko
ta: அனைத்தையும் தேர்ந்தெடுக்கவும்
uk: Відхилити усе

source: General
de: Allgemein
sk: Všeobecné
ta: பொது
uk: Загальне

source: Keyboard Shortcuts
de: Tastaturkurzbefehle
ro: Combinații taste rapide
sk: Klávesové skratky
ta: விசைப்பலகை குறுக்குவழிகள்
uk: Клавіатурні Скорочення

source: Quit
de: Beenden
ro: Ieșire
sk: Ukončiť
ta: வெளியேறு
uk: Вийти

source: _Abort
de: _Abbrechen
ro: _Anulare
sk: _O
ta: _போர்ட்
uk: _Перервати

source: About Commit
de: Über Commit
ro: Despre Commit
sk: O Commite
ta: கமிட் பற்றி
uk: Про Commit

source: Preferences
de: Einstellungen
ro: Preferințe
sk: Predvoľby
ta: விருப்பத்தேர்வுகள்
uk: Налаштування

source: Git
ta: அறிவிலி

source: To set Commit as default editor for Git run the following command in Terminal
de: Um Commit als Standardeditor für Git festzulegen, führe folgenden Befehl im Terminal aus
ro: Pentru a stabili Commit ca editor implicit pentru Git, executați următoarea comandă în Terminal
sk: Pokiaľ chcete nastaviť Commit ako predvolený editor pre Git, spustite v terminály nasledujúci príkaz
ta: GIT க்கான இயல்புநிலை எடிட்டராக உறுதிப்பாட்டை அமைக்க முனையத்தில் பின்வரும் கட்டளையை இயக்கவும்
uk: Щоб встановити Commit звичайним редактором для Git запустіть цю команду у Терміналі

source: Copy to Clipboard
de: In die Zwischenablage kopieren
ro: Copiază în clipboard
sk: Skopírovať do schránky
ta: கிளிப்போர்டுக்கு நகலெடுக்கவும்
uk: Скопіювати до буферу обміну

source: Documentation
de: Dokumentation
ro: Documentație
sk: Dokumentácia
ta: ஆவணப்படுத்துதல்
uk: Документація

source: Mercurial
ta: மெர்குரியல்

source: To set Commit as default editor for Mercurial, set the following in your <tt>hgrc</tt>
de: Um Commit als Standardeditor für Mercurial festzulegen, Folgendes im eigenen <tt>hgrc</tt> festlegen
ro: Pentru a stabili Commit ca editor implicit pentru Mercurial, definiți următoarele în <tt>hgrc</tt>
sk: Pokiaľ chcete nastaviť Commit ako predvolený editor pre Mercurial, nastavte nasledujúce vo vašom <tt>hgrc</tt>
ta: மெர்குரியலுக்கான இயல்புநிலை எடிட்டராக உறுதிப்பாட்டை அமைக்க, பின்வருவனவற்றை உங்கள் <tt> HGRC </tt> இல் அமைக்கவும்
uk: Щоб встановити Commit як звичайний редактор для Mercurial, встановіть це у Вашому <tt>hgrc</tt>

source: _Commit
ro: _Comitere modificări
sk: _Komit
uk: _Комміт

source: _Tag
de: _Markieren
ro: _Etichetă
sk: _Štítok
uk: _Тегування

source: A_dd
de: _Hinzufügen
ro: A_dăugare
sk: Pri_dať
uk: _Додати
