Repository: sonnyp/Commit
Catalog: po/*.po
Languages: it, ja, nl, tr

source: Commit message editor
it: Editor del messaggio di commit
ja: コミットメッセージエディター
nl: Bewerk commit­berichten
tr: Commit metin düzenleyici

source: Title maximum length (in characters)
it: Lunghezza massima del titolo (in caratteri)
ja: タイトルの最大文字数
nl: Maximale titellengte (in tekens)
tr: Maksimum başlık uzunluğu (karakter sayısı olarak)

source: Body lines maximum length (in characters)
it: Lunghezza massima del corpo del messaggio (in caratteri)
ja: 本文の最大文字数
nl: Maximale omschrijvingslengte (in tekens)
tr: Maksimum body satırı uzunluğu (karakter sayısı olarak)

source: Commit is an editor that helps you write better Git and Mercurial commit messages.
it: Commit è un editor che aiuta a scrivere messaggi di commit per Git e Mercurial migliori.
ja: Commit は、Git や Mercurial のコミットメッセージをより良く書けるエディターです。
nl: Commit is een bewerker die u helpt betere commit-berichten voor Git en Mercurial te schrijven.
tr: Commit, daha iyi Git ve Mercurial commit mesajları yazmanıza yardımcı olan bir düzenleyicidir.

source: After installing make sure to launch the application and follow the instructions.
it: Dopo l'installazione, assicurarsi di lanciare l'applicazione e seguire le istruzioni.
ja: インストール後は、必ずアプリケーションを起動し、指示に従ってください。
nl: Installeer Commit, open een nieuw venster en volg de instructies.
tr: Kurulum tamamlandıktan sonra uygulamayı açıp talimatları izlediğinizden emin olun.

source: Commit will pop up automatically when you make a commit in one of your projects. To save your commit message, press the Commit button or the <code>Ctrl+Return</code> shortcut. To abort and dismiss Commit, press the Abort button or the <code>Escape</code> key.
it: Commit verrà lanciato automaticamente al momento del commit in un progetto. Per salvare il messaggio di commit, premere il pulsante Commit o la combinazione di tasti <code>Ctrl+Invio</code>. Per annullare e chiudere Commit, premere il pulsante Annulla o il tasto <code>Esc</code>.
ja: プロジェクトでコミットすると、Commit が自動的にポップアップします。コミットメッセージを保存するには、"コミット" ボタンか、<code>Ctrl+Return</code> ショートカットキーを押します。Commit を中断して却下するには、"中断" ボタンか <code>Escape</code> キーを押します。
nl: Commit verschijnt automatisch wanneer u een commit maakt in één van uw projecten. Druk op de commit-knop of gebruik <code>Ctrl+Enter</code> om het bericht op te slaan. Druk op de annuleerknop of gebruik <code>Escape</code> om af te breken.
tr: Commit projelerinizde bir commit eylemi gerçekleştirdiğinizde otomatik olarak ortaya çıkar. Commit mesajınızı kaydetmek için, Commit butonunu yada <code>Ctrl+Return</code> kısayolunu kullanın. Commiti geri almak ve iptal etmek için Abort butonunu yada <code>Escape</code> tuşunu kullanın.

source: Features:
it: Funzionalità:
ja: 機能:
nl: Kenmerken:
tr: Özellikler:

source: Highlights overflow of the commit title
it: Evidenzia lo sforamento del numero di caratteri nel titolo del commit
ja: コミットタイトル超過時に強調表示
nl: Markeert het te lange gedeelte van de commit-titel
tr: İşleme başlığının taşmasını vurgular

source: Smart body wrapping
it: Ritorno a capo automatico intelligente
ja: スマートに本文を折り返し
nl: Slimme beschrijvings-wrapping
tr: Akıllı vücut sarma

source: Inserts a blank line between title and body
it: Inserisce una riga vuota tra titolo e descrizione
ja: タイトルと本文の真ん中を改行の挿す
nl: Voegt een lege regel toe tussen de naam en omschrijving
tr: Başlık ve gövde arasına boş bir satır ekler

source: Comments are readonly and excluded from "Select All"
it: I commenti sono in sola lettura ed esclusi da «Seleziona tutto»
ja: コメントは表示のみで、"すべて選択" の対象外
nl: Reacties zijn alleen-lezen en uitgesloten van ‘Alles selecteren’
tr: Yorumlar salt okunurdur ve "Tümünü Seç"ten hariç tutulur

source: Displays project folder and branch in window header
it: Mostra la cartella del progetto e il branch nella barra del titolo
ja: ウィンドウのヘッダーにプロジェクトフォルダーとブランチを表示
nl: Toont de projectmap en -branch op de titelbalk
tr: Pencere başlığında proje klasörünü ve dalı görüntüler

source: Dark mode support
it: Supporto per il tema scuro
ja: ダークモードへの対応
nl: Nieuw: ondersteuning voor donkere thema's
tr: Karanlık mod desteği

source: Keyboard navigation and shortcuts
it: Navigazione da tastiera e scorciatoie
ja: キーボードでの操作とショートカット
nl: Toetsenbordnavigatie en sneltoetsen
tr: Klavye navigasyonu ve kısayollar

source: Undo/Redo support
it: Supporto per annulla/ripeti
ja: 元に戻す/やり直す への対応
nl: Ondersteuning voor ongedaan maken en opnieuw
tr: Geri al/Yinele desteği

source: Emoji picker
it: Selezione di emoji
ja: 絵文字ピッカー
nl: Emoji-kiezer
tr: Emoji seçici

source: Supports git commit, merge, tag --annotate, add --patch, rebase --interactive
it: Supporta i comandi di git «commit», «merge», «tag --annotate», «add --patch» e «rebase --interactive»
ja: git commit / merge / tag --annotate / add --patch / rebase --interactive に対応
nl: Ondersteunt git commit, merge, tag --annotate, add --patch, rebase --interactive
tr: Git işlemelerini destekler (commit, merge, tag --annotate, add --patch, rebase --interactive)

source: Supports Mercurial commit
it: Supporta i commit di Mercurial
ja: Mercurial コミットに対応
nl: Ondersteunt Mercurial-commits
tr: Mercuiral işlemeyi destekler

source: Auto capitalize the commit title
it: Maiuscole automatiche nel titolo del commit
ja: コミットのタイトルを自動的に大文字にする
nl: Automatisch hoofdlettergrbruik van de commit-titel
tr: İşleme başlığını otomatik olarak büyük harfle yaz

source: Welcome window with settings and instructions
it: Schermata di benvenuto con impostazioni e istruzioni
ja: ようこそウィンドウに設定項目と説明を表示
nl: Welkomstvenster met voorkeuren en een uitleg
tr: Ayarlar ve talimatlar içeren karşılama penceresi

source: Highlight syntax for Git, Mercurial and diffs
it: Evidenziazione della sintassi per Git, Mercurial e diff
ja: Git、Mercurial、diff のシンタックスハイライトに対応
nl: Syntax-highlighting voor Git, Mercurial en diffs
tr: Git, Mercurial ve farklar için sözdizimini vurgulayın

source: Main window
it: Finestra principale
ja: メインウィンドウ
nl: Hoofdvenster
tr: Ana pencere

source: Emoji selector
it: Selettore di emoji
ja: 絵文字セレクター
nl: Emoji-kiezer
tr: Emoji seçici

source: Shortcuts
it: Scorciatoie
ja: ショートカット
nl: Sneltoetsen
tr: Kısayollar

source: Welcome window
it: Schermata di benvenuto
ja: ようこそウィンドウ
nl: Welkomstvenster
tr: Karşılama penceresi

source: Resize the window to disable auto formatting
it: Ridimensiona la finestra per disabilitare l'auto formattazione
ja: ウィンドウをサイズ変更して自動フォーマットを無効化
nl: Verander de venstergrootte om automatisch formatteren uit te schakelen
tr: Otomatik biçimlendirmeyi devre dışı bırakmak için pencereyi yeniden boyutlandırın

source: Add a theme switcher
it: Aggiungi un commutatore di temi
ja: テーマスイッチャーの追加
nl: Themawisselaar toegevoegd
tr: Bir tema değiştirici ekle

source: Improve dark mode support
it: Migliorato il supporto per il tema scuro
ja: ダークモードへの対応を改善
nl: Verbeterde ondersteuning voor donkere modus
tr: Karanlık mod desteğini geliştirin

source: Support numpad enter
it: Supporto per il tasto enter del tastierino numerico
ja: テンキーの Enter キーに対応
nl: Ondersteuning voor enter op numerieke toetsen
tr: Numpad girişini destekler

source: Add mnemonics for buttons
it: Aggiungi gli aiuti mnemonici per i bottoni
ja: ボタンにニーモニックを追加
nl: Mnemonics voor knoppen toegevoegd
tr: Düğmeler için anımsatıcılar ekleyin

source: Fix capitalization when amending
it: Sistemato il maiuscolo quando si modifica
ja: amend 時の大文字化の不具合を修正
nl: Hoofdlettergebruik bij amenden verbeterd
tr: Değişiklik yaparken büyük harf kullanımını düzeltin

source: Improve auto capitalization
it: Migliora la gestione automatica delle lettere maiuscole
ja: 自動大文字化を改善
nl: Automatisch hoofdlettergebruik verbeterd
tr: Otomatik büyük harf kullanımını iyileştirin

source: Add support for gitconfig and hgrc
it: Aggiunto supporto per gitconfig e hgrc
ja: gitconfig と hgrc に対応
nl: Ondersteuning toegevoegd oor gitconfig en hgrc
tr: Gitconfig ve hgrc için destek ekle

source: Support editing any file
it: Supporto per la modifica di qualsiasi file
ja: 任意ファイルの編集に対応
nl: Ondersteuning voor het bewerken van elk bestand
tr: Herhangi bir dosyayı düzenlemeyi destekler

source: Make the primary button label dynamic (Tag, Rebase, Commit, ...)
it: Rendi dinamico il pulsante primario (Tag, Rebase, Commit, …)
ja: 主ボタンのラベルを動的に切り替え (タグを追加、リベース、コミット など)
nl: Label van primaire knop dynamisch gemaakt (Taggen, Rebasen, Committen, …)
tr: Birincil düğme etiketini dinamik yap (Etiket, Yeniden Temel, İşlem, ...)

source: Use 2 spaces indentation
it: Usa 2 spazi per l'indentazione
ja: インデントにスペース2つを使用
nl: Indentatie met dubbele spatie ingesteld
tr: 2 boşluk girintisi kullanın

source: Add menu button
it: Aggiunto pulsante del menù
ja: メニューボタンを追加
nl: Menu-knop toegevoegd
tr: Menü düğmesi ekle

source: GNOME Platform 42
it: Piattaforma GNOME 42
ja: GNOMEプラットフォーム 42
tr: GNOME Platformu 42

source: Various fixes
it: Correzioni varie
ja: 様々な修正
nl: Enkele foutoplossingen
tr: Çeşitli düzeltmeler

source: Add keyboard shortcuts for moving lines up and down
it: Aggiunte scorciatoie da tastiera per muovere su e giù le righe
ja: 行を上下に移動するキーボードショートカットを追加
nl: Sneltoetsen toegevoegd voor het omhoog/omlaag verplaatsen van regels
tr: Satırları yukarı ve aşağı taşımak için klavye kısayolları ekleyin

source: Highlight syntax for Git, Mercurial, and diffs
ja: Git、Mercurial、diff のシンタックスハイライト
nl: Highlight-syntax voor Git, Mercurial en diffs
tr: Git, Mercurial ve farklar için sözdizimini vurgulayın

source: Add a shortcuts window
it: Aggiunta una finestra delle scorciatoie
ja: ショートカットウィンドウを追加
nl: Sneltoetsen-venster toegevoegd
tr: Bir kısayol penceresi ekleyin

source: Remove spell check temporarily
it: Rimozione temporanea del controllo ortografico
ja: スペルチェック機能を一時的に削除
nl: Spellingcontrole is tijdelijk verwijderd
tr: Yazım denetimini geçici olarak kaldır

source: Support undo and redo
it: Supporto per annulla e ripeti
ja: 元に戻す/やり直す に対応
nl: Ondersteuning voor ongedaan maken en opnieuw uitvoeren
tr: Geri alma ve yineleme desteği

source: Add symbolic icon
it: Aggiunta icona simbolica
ja: シンボリックアイコンを追加
nl: Symbolisch pictogram toegevoegd
tr: Sembolik simge ekle

source: Add dark mode setting
it: Aggiunta impostazione per tema scuro
ja: ダークモードの設定を追加
nl: Instelling voor donker thema toegevoegd
tr: Karanlık mod ayarı ekle

source: Focus the text editor
it: Focus all'editor di testo
ja: テキストエディターにフォーカスを設定
nl: Tekstbewerker gefocust
tr: Metin düzenleyiciye odaklan

source: Port to GTK 4 and libadwaita
it: Migrazione a GTK4 e libadwaita
ja: GTK 4 と libadwaita への移植
nl: Bijgewerkt naar GTK 4 en LibAdwaita
tr: GTK 4 ve libadwaita'ya bağlantı noktası

source: Move preferences to welcome window
it: Spostamento delle preferenze nella finestra di benvenuto
ja: 設定項目をようこそウィンドウに移動
nl: Het voorkeurenvenster is verplaatst naar het welkomstvenster
tr: Tercihleri karşılama penceresine taşı

source: Only highlight text overflow on commits
it: Evidenziazione solo dello sforamento del testo nei commit
ja: コミットメッセージでテキストの超過のみをハイライト表示するように修正
nl: Tekstmarkering vindt alleen plaats op commits
tr: Yalnızca işlemelerde metin taşmasını vurgulayın

source: New app icon
it: Nuova icona dell'applicazione
ja: 新しいアプリアイコン
nl: Nieuw app-pictogram
tr: Yeni uygulama ikonu

source: Remove double border
it: Rimozione del bordo doppio
ja: 重複する枠線を削除
nl: Dubbele rand verwijderd
tr: Çift kenarlığı kaldır

source: Add a Preferences window
it: Aggiunta di una finestra delle preferenze
ja: 設定ウィンドウを追加
nl: Voorkeurenvenster toegevoegd
tr: Tercihler penceresi ekleyin

source: Set default title length hint to 50 characters
it: Impostazione a 50 caratteri dell'indicazione per la lunghezza predefinita del titolo
ja: デフォルトのタイトル最大文字数を 50 文字に設定
nl: Richtlijn voor standaardtitellengte ingesteld op 50 tekens
tr: Varsayılan başlık uzunluğu ipucunu 50 karaktere ayarla

source: Fix reading commits with special characters
it: Correzione della lettura di commit con caratteri speciali
ja: 特殊文字が含まれるコミットを読み込めるように修正
nl: Fout bij uitlezen van commits met speciale tekens opgelost
tr: Özel karakterlerle okuma işlemelerini düzeltin

source: Fix git rebase not recognized
it: Correzione di git rebase non riconosciuto
ja: git rebase が認識されない不具合を修正
nl: Fout opgelost waar git rebase niet werd herkend
tr: Git rebase tanınmadı düzeltildi

source: Make windows bottom corners rounded
it: Arrotondamento degli angoli inferiori delle finestre
ja: ウィンドウ下部の隅を丸めるように変更
nl: Onderste vensterhoeken afgerond
tr: Pencerelerin alt köşelerini yuvarlatın

source: Add 6px margin to editor
it: Aggiunta di un margine di 6 px all'editor
ja: エディターに 6 px のマージンを追加
nl: 6px-marge aan de bewerker toegevoegd
tr: Düzenleyiciye 6px kenar boşluğu ekleyin

source: Action required. After updating, please launch the application and follow the instructions.
it: Azione richiesta. Dopo l'aggiornamento, lanciare l'applicazione e seguire le istruzioni.
ja: アクションが必要です。アップデート後、アプリケーションを起動し、指示に従ってください。
nl: Actie vereist. Open de app na het bijwerken en volg de instructies.
tr: Eylem Gerekli. Güncellemeden sonra, lütfen uygulamayı başlatın ve talimatları izleyin.

source: Show a welcome window when launched from desktop
it: Mostrare una finestra di benvenuto quando è lanciato dal desktop
ja: デスクトップから起動した際にようこそウィンドウを表示
nl: Welkomstvenster bij direct starten toegevoegd
tr: Masaüstünden başlatıldığında bir karşılama penceresi göster

source: Add support for Mercurial
it: Aggiunta supporto per Mercurial
ja: Mercurial に対応
nl: Mercurial-ondersteuning toegevoegd
tr: Mercurial için destek ekleyin

source: Remove filesystem permission
it: Rimozione del permesso del filesystem
ja: ファイルシステムアクセス権限を削除
nl: Bestandssysteemrechten verwijderd
tr: Dosya sistemi iznini kaldır

source: Initial release. Forked from Gnomit 2.0.
it: Versione iniziale. Fork di Gnomit 2.0.
ja: 初リリース。Gnomit 2.0 からフォークしました。
nl: Eerste uitgave, afgesplitst van Gnomit 2.0.
tr: İlk sürüm. Gnomit 2.0'dan çatallanmıştır.

source: Support "#" in commit message
it: Supporto di "#" nei messaggi di commit
ja: コミットメッセージ内の "#" に対応
nl: Ondersteuning voor ‘#’ in commit-berichten
tr: İşleme mesajlarında "#" desteği

source: Properly recognize executable path
it: Corretto riconoscimento del percorso dell'eseguibile
ja: 実行可能ファイルのパスを適切に認識するように修正
nl: Duidelijk herkenbaar uitvoerbaar pad
tr: Çalıştırılabilir yolu düzgün bir şekilde tanımlayın

source: translator-credits
it: Davide Ferracin <davide.ferracin@protonmail.com>
ja: Tomo Ryo Nakano
nl: Heimen Stoffels <vistausss@fastmail.com> Philip Goto https://flipflop97.github.io/
tr: Eren İnce <erenince@proton.me>

source: _Commit
ja: コミット(_C)
nl: _Committen
tr: _İşleme

source: _Merge
ja: マージ(_M)
nl: _Mergen
tr: _Birleştirme

source: _Tag
ja: タグを追加(_T)
nl: _Taggen
tr: _Etiket

source: A_dd
it: _Aggiungi
ja: 追加(_D)
nl: Toe_voegen

source: _Rebase
ja: リベース(_R)
nl: _Rebasen
tr: _Yeniden tabanlama

source: _Save
it: _Salva
ja: 保存(_S)
nl: _Opslaan
tr: _Kaydet

source: Editing
it: Modifica
ja: 編集
nl: Aan het bewerken
tr: Düzenleme

source: Save and confirm
it: Salva e conferma
ja: 保存して確認
nl: Opslaan en bevestigen
tr: Kaydet ve onayla

source: Cancel and dismiss
it: Annulla e chiudi
ja: キャンセルして中断
nl: Annuleren en afwijzen
tr: İptal et ve kapat

source: Open emoji chooser
it: Scegli un emoji
ja: 絵文字ピッカーを開く
nl: Emoji-kiezer openen
tr: Emoji seçiciyi aç

source: Move current line up/down
it: Muovi la riga corrente su o giù
ja: 現在の行を 上/下 に移動
nl: Huidige regel omhoog/omlaag verplaatsen
tr: Geçerli satırı yukarı/aşağı taşı

source: Select All
it: Seleziona tutto
ja: すべて選択
nl: Alles selecteren
tr: Hepsini Seç

source: Unelect All
it: Deseleziona tutto
ja: すべて選択解除
nl: Alles deselecteren
tr: Tümünün Seçimini Kaldır

source: General
it: Generali
ja: 一般
nl: Algemeen
tr: Genel

source: Keyboard Shortcuts
it: Scorciatoie da tastiera
ja: キーボードショートカット
nl: Sneltoetsen
tr: Klavye Kısayolları

source: Quit
it: Esci
ja: 終了する
nl: Sluiten
tr: Çık

source: _Abort
ja: Commit について(_A)
nl: _Afbreken
tr: _İptal

source: About Commit
it: Informazioni su Commit
ja: Commit について
nl: Over Commit
tr: İşleme Hakkında

source: Preferences
it: Preferenze
ja: 設定
nl: Voorkeuren
tr: Tercihler

source: To set Commit as default editor for Git run the following command in Terminal
it: Per impostare Commit come editor predefinito, eseguire il seguente comando nel terminale
ja: Commit を Git のデフォルトエディターに設定するには、端末で以下のコマンドを実行してください
nl: Voer de volgende terminalopdracht uit om Commit in te stellen als standaardbewerker voor Git
tr: Commit'i Git için varsayılan düzenleyici olarak ayarlamak için Terminal'de aşağıdaki komutu çalıştırın

source: Copy to Clipboard
it: Copia negli appunti
ja: クリップボードにコピー
nl: Kopiëren naar klembord
tr: Panoya kopyala

source: Documentation
it: Documentazione
ja: ドキュメンテーション
nl: Documentatie
tr: Belgeler

source: https://git-scm.com/book/en/v2/Customizing-Git-Git-Configuration#_core_editor
it: https://git-scm.com/book/it/v2/Customizing-Git-Git-Configuration#_core_editor
ja: https://git-scm.com/book/ja/v2/Git-のカスタマイズ-Git-の設定#_core_editor

source: To set Commit as default editor for Mercurial, set the following in your <tt>hgrc</tt>
it: Per impostare Commit come editor predefinito per Mercurial, impostare ciò che segue nel proprio <tt>hgrc6</tt>
ja: Commit を Mercurial のデフォルトエディターに設定するには、<tt>hgrc</tt> に以下を設定してください
nl: Stel het volgende in in uw <tt>hgrc</tt> om Commit in te stellen als standaardbewerker voor Mercurial
tr: Commit'i Mercurial için varsayılan düzenleyici olarak ayarlamak üzere <tt>hgrc</tt> içinde aşağıdakini ayarlayın
